RIET/src/Catalogs/RulesOfCVCRisks/RulesOfCVCRisks.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>RulesOfCVCRisks</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Field</name>
    <type>
      <types>EnumRef.FieldsForRulesOfCVCRisks</types>
    </type>
  </attributes>
  <attributes>
    <name>Value</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TNVEDCode</name>
    <type>
      <types>CatalogRef.TNVEDCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDemand</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>GoodsDescription</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>POAs</name>
    <attributes>
      <name>POA</name>
      <type>
        <types>CatalogRef.SeaAndAirPorts</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Enums/FieldsForRulesOfCVCRisks/FieldsForRulesOfCVCRisks.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>FieldsForRulesOfCVCRisks</name>
  <enumValues>
    <name>PartNumber</name>
  </enumValues>
  <enumValues>
    <name>Description</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/RulesOfCVCRisks/Forms/ФормаЭлемента/Module.bsl
/////////////////////////////////////////////////////////////////////////////////////
// ФОРМА

// ПРИ СОЗДАНИИ НА СЕРВЕРЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	TypeOfComparison = ПолучитьTypeOfComparison(Объект.Field);
	
КонецПроцедуры

// ПЕРЕД ЗАПИСЬЮ

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	РГСофтКлиент.ПроверитьНеобходимостьЗаписиСправочника(Модифицированность, Отказ);
	
КонецПроцедуры

// ПЕРЕД ЗАПИСЬЮ НА СЕРВЕРЕ

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РГСофтКлиентСервер.УстановитьЗначение(ТекущийОбъект.ModifiedBy, ПараметрыСеанса.ТекущийПользователь);
	ТекущийОбъект.ModificationDate = ТекущаяДата();
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////
// ЭЛЕМЕНТЫ УПРАВЛЕНИЯ

&НаКлиенте
Процедура FieldПриИзменении(Элемент)
	
	TypeOfComparison = ПолучитьTypeOfComparison(Объект.Field);
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////
// ТАБЛИЧНАЯ ЧАСТЬ POAs

&НаКлиенте
Процедура POAsПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ОткрытьФорму("Справочник.SeaAndAirPorts.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура POAsОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив")
		И ВыбранноеЗначение.Количество() > 0
		И ТипЗнч(ВыбранноеЗначение[0]) = Тип("СправочникСсылка.SeaAndAirPorts") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.POAs.Добавить();
			НоваяСтрока.POA = Значение;
		КонецЦикла;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура POAsВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(ТекущиеДанные.POA) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(,ТекущиеДанные.POA);
	КонецЕсли;
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////
// ОБЩЕЕ

&НаСервереБезКонтекста
Функция ПолучитьTypeOfComparison(Field)
	
	Если Field = Перечисления.FieldsForRulesOfCVCRisks.PartNumber Тогда
		Возврат "equal";
	ИначеЕсли Field = Перечисления.FieldsForRulesOfCVCRisks.Description Тогда
		Возврат "contains";
	Иначе
		Возврат "";
	КонецЕсли; 
	
КонецФункции
